# 1.	Создать папку на рабочем столе с помощью os.
import os
# создать пустой каталог (папку)
if not os.path.isdir("folder"):
     os.mkdir("folder")
# 2.	Удалить созданную папку с помощью os.

# 3.	Создать файл task_1.txt и переименовать его на renamefile.txt

# 4.	Создайте словарь из строки 'hellomynameis' следующим образом: в качестве ключей возьмите буквы строки, а значениями пусть будут числа, соответствующие количеству вхождений данной буквы в строку.

# 5.	Даны два списка одинаковой длины. Необходимо создать из них словарь таким образом, чтобы элементы первого списка были ключами, а элементы второго — соответственно значениями нашего словаря.

# 6.	Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором.

# 7.	Создать кортеж с числами от 1 до 50 используя генератор списков

# 8.	Дан словарь с числовыми значениями. Необходимо их все перемножить и вывести на экран.

# 9.	Создать список. Проверить, есть ли в последовательности дубликаты
